app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test1"], ["body", "test1"], ["created_at", "2023-07-06 02:09:45.773565"], ["updated_at", "2023-07-06 02:09:45.773565"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    if @book.save
      flash[:notice] = "Book was successfully created."
      redirect_to book_path(@book.id)
    else
      @books = Book.all

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "test2"], ["body", "test2"], ["updated_at", "2023-07-06 02:23:29.941250"], ["id", 16]]
SELECT "books".* FROM "books"
---
  def update
    book = Book.find(params[:id])
    if book.update(book_params)
      flash[:notice] = "Book was successfully updated."
      redirect_to book_path(book.id)
    else
      @books = Book.all

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 22]]
---
  def destroy
    book = Book.find(params[:id])
    if book.destroy